<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("");
?><h1>Магазин спортивного питания в&nbsp;{{city|предложный}}</h1>
<p>
	 Интернет-магазин спортивного питания «Atletera» предлагает большой выбор пищевых добавок, которые помогают восстановиться после нагрузок, улучшить спортивные показатели, набрать массу или похудеть. Также у нас можно недорого купить аксессуары для спортсменов: бинты, шейкеры, эспандеры, перчатки, полезные перекусы и напитки, пояса и многое другое.
</p>
<h2>Какое спортивное питание мы продаем</h2>
<ul>
	<li>
	<p>
 <a href="/e-store/aminokisloty/">Аминокислоты</a> улучшают выносливость, ускоряют метаболизм, повышают иммунитет, помогают быстрее восстановиться после тренировок, очищают печень.
	</p>
 </li>
	<li>
	<p>
 <a href="/e-store/zhiroszhigateli/">Жиросжигатели</a> — выводят избыточную влагу из организма, нормализуют обменные процессы, активируют окисление жировых отложений, поэтому убирают лишний вес.
	</p>
 </li>
	<li>
	<p>
 <a href="/e-store/predtrenirovochnyy_kompleks/">Предтренировочные комплексы</a> - этот тип спортивного питания повышает работоспособность, улучшает показатели, продлевает время занятий.
	</p>
 </li>
	<li>
	<p>
 <a href="/e-store/proteiny/">Протеин</a> – самая востребованная в рационе спортсменов добавка, дающая рост мышц.
	</p>
 </li>
	<li>
	<p>
 <a href="/e-store/vitaminy_i_mineraly/">Витамины и минералы</a> помогают быстрее восстановиться между тренировками, улучшают выносливость, повышают иммунитет.
	</p>
 </li>
	<li>
	<p>
 <a href="/e-store/geynery/">Гейнеры</a> компенсируют недостаток белка, усиливают анаболические процессы в организме. Чтобы пополнить энергетический запас и быстрее восстановиться, нужно принимать их сразу после тренировки.
	</p>
 </li>
	<li>
	<p>
 <a href="/e-store/izotoniki_i_energetiki/">Изотоники и энергетики</a> снижают утомляемость, восстанавливают мускулатуру после тренировки, восполняют запас электролитов в организме.
	</p>
 </li>
	<li>
	<p>
 <a href="/e-store/kreatin/">Креатин</a> ускоряет метаболизм, снижает усталость, способствует наращиванию мышечной массы.
	</p>
 </li>
</ul>
<p>
	 У нас более 1000 товаров – с полным каталогом можно ознакомиться в интернет-магазине. В разделах «Акция» и «Распродажа» вас всегда ждут хорошие скидки и интересные предложения.
</p>
<p>
	 Мы занимаем лидирующие позиции по продаже спортивного питания в {{city|предложный}}. Оформляйте покупку онлайн в любое удобное время. При заказе на 2000 рублей <a href="/shipping/">доставка</a> бесплатна. Отправляем в другие регионы. Подробности по телефону 8 800 222 13 40.
</p><?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>