<div class="delivery-block clearfix">

        <h2>Томск, Северск</h2>
        <div class="delivery-block-city">
            <h3>Доставка</h3>
            <p>
                Бесплатно при заказе свыше 2000 р.<br>
                Стоимость доставки при заказе менее 2000 р. составит 150 р.<br>
                Доставка в отдаленные районы города дополнительно 150 р.
            </p>
        </div>
        <div class="delivery-block-city">
            <h3>Оплата</h3>
            <p>
                Оплата за товар&nbsp;при доставке курьером по <strong>Томску и Северску</strong>&nbsp;производится
                наличными, либо по картам VISA, Mastercard, при получении заказа.
            </p>

        </div>
        <div class="delivery-block-info">
            <p>
                Заказы, оформленные до 15 часов, доставляются в тот же день с 16 до 21 час.<br>
                Заказы, оформленные после 15 часов, доставляются на следующий день с 16 до 21 час.
            </p>
            <p>
                В субботу заказы принимаются до 14 часов, доставляются с 15 до 18 час.<br>
                Заказы, оформленные в субботу после 14 часов и в воскресение, доставляются в понедельник с 16 до 21 час.
            </p>
            <div class="delivery-important">
                В воскресенье доставка не работает
            </div>
        </div>
        <div style="clear:both;">&nbsp;</div>
    </div>
    <div class="payment-block">


        <h2>Межгород</h2>
        <div class="payment-block-city">
            <h3>Доставка</h3>
            <p>Отправка заказов в другие города осуществляется только после&nbsp;оплаты.&nbsp;Товар резервируется, при
                отсутствии оплаты в течении 3-х дней,&nbsp;заказ отменяется. Наложенным платежем не отправляем.</p>
        </div>

        <h3>Оплата</h3>
        <p>Для оплаты междугородних заказов&nbsp;вам необходимо произвести 100% предоплату стоимости&nbsp;товаров +
            стоимость доставки (рассчитывается при оформлении заказа). Для этого вы можете использовать следующие
            способы:</p>


        <img style="display: block; margin: 0 auto;" src="/upload/medialibrary/910/2234_sberbank-image.jpg">
        <strong>
        </strong></div><strong>

    <br></strong>