<?php
/**
 * Belarusian PHPMailer language file: refer to English translation for definitive list
 * @package PHPMailer
 * @author Aleksander Maksymiuk <info@setpro.pl>
 */

$PHPMAILER_LANG['authenticate']         = 'Р СџР В°Р С?РЎвЂ№Р В»Р С”Р В° SMTP: Р С—Р В°Р С?РЎвЂ№Р В»Р С”Р В° РЎвЂ“Р Т‘РЎРЊР Р…РЎвЂљРЎвЂ№РЎвЂћРЎвЂ“Р С”Р В°РЎвЂ РЎвЂ№РЎвЂ“.';
$PHPMAILER_LANG['connect_host']         = 'Р СџР В°Р С?РЎвЂ№Р В»Р С”Р В° SMTP: Р Р…Р ВµР В»РЎРЉР С–Р В° РЎС›РЎРѓРЎвЂљР В°Р Р…Р В°Р Р†РЎвЂ“РЎвЂ РЎРЉ РЎРѓРЎС“Р Р†РЎРЏР В·РЎРЉ Р В· SMTP-РЎРѓР ВµРЎР‚Р Р†Р ВµРЎР‚Р В°Р С?.';
$PHPMAILER_LANG['data_not_accepted']    = 'Р СџР В°Р С?РЎвЂ№Р В»Р С”Р В° SMTP: Р В·Р Р†Р ВµРЎРѓРЎвЂљР С”РЎвЂ“ Р Р…Р ВµР С—РЎР‚РЎвЂ№Р Р…РЎРЏРЎвЂљРЎвЂ№РЎРЏ.';
$PHPMAILER_LANG['empty_message']        = 'Р СџРЎС“РЎРѓРЎвЂљР С•Р Вµ Р С—Р В°Р Р†Р ВµР Т‘Р В°Р С?Р В»Р ВµР Р…Р Р…Р Вµ.';
$PHPMAILER_LANG['encoding']             = 'Р СњР ВµР Р†РЎРЏР Т‘Р С•Р С?Р В°РЎРЏ Р С”Р В°Р Т‘РЎвЂ№РЎР‚Р С•РЎС›Р С”Р В° РЎвЂљРЎРЊР С”РЎРѓРЎвЂљРЎС“: ';
$PHPMAILER_LANG['execute']              = 'Р СњР ВµР В»РЎРЉР С–Р В° Р Р†РЎвЂ№Р С”Р В°Р Р…Р В°РЎвЂ РЎРЉ Р С”Р В°Р С?Р В°Р Р…Р Т‘РЎС“: ';
$PHPMAILER_LANG['file_access']          = 'Р СњРЎРЏР С?Р В° Р Т‘Р С•РЎРѓРЎвЂљРЎС“Р С—РЎС“ Р Т‘Р В° РЎвЂћР В°Р в„–Р В»Р В°: ';
$PHPMAILER_LANG['file_open']            = 'Р СњР ВµР В»РЎРЉР С–Р В° Р В°Р Т‘Р С”РЎР‚РЎвЂ№РЎвЂ РЎРЉ РЎвЂћР В°Р в„–Р В»: ';
$PHPMAILER_LANG['from_failed']          = 'Р СњРЎРЏР С—РЎР‚Р В°Р Р†РЎвЂ“Р В»РЎРЉР Р…РЎвЂ№ Р В°Р Т‘РЎР‚Р В°РЎРѓ Р В°Р Т‘Р С—РЎР‚Р В°РЎС›Р Р…РЎвЂ“Р С”Р В°: ';
$PHPMAILER_LANG['instantiate']          = 'Р СњР ВµР В»РЎРЉР С–Р В° Р С—РЎР‚РЎвЂ№Р С?РЎРЏР Р…РЎвЂ“РЎвЂ РЎРЉ РЎвЂћРЎС“Р Р…Р С”РЎвЂ РЎвЂ№РЎР‹ mail().';
$PHPMAILER_LANG['invalid_address']      = 'Р СњР ВµР В»РЎРЉР С–Р В° Р Т‘Р В°РЎРѓР В»Р В°РЎвЂ РЎРЉ Р С—Р В°Р Р†Р ВµР Т‘Р В°Р С?Р В»Р ВµР Р…Р Р…Р Вµ, Р Р…РЎРЏР С—РЎР‚Р В°Р Р†РЎвЂ“Р В»РЎРЉР Р…РЎвЂ№ email Р В°РЎвЂљРЎР‚РЎвЂ№Р С?Р В°Р В»РЎРЉР Р…РЎвЂ“Р С”Р В°: ';
$PHPMAILER_LANG['provide_address']      = 'Р вЂ”Р В°Р С—Р С•РЎС›Р Р…РЎвЂ“РЎвЂ Р Вµ, Р С”Р В°Р В»РЎвЂ“ Р В»Р В°РЎРѓР С”Р В°, Р С—РЎР‚Р В°Р Р†РЎвЂ“Р В»РЎРЉР Р…РЎвЂ№ email Р В°РЎвЂљРЎР‚РЎвЂ№Р С?Р В°Р В»РЎРЉР Р…РЎвЂ“Р С”Р В°.';
$PHPMAILER_LANG['mailer_not_supported'] = ' - Р С—Р В°РЎв‚¬РЎвЂљР С•Р Р†РЎвЂ№ РЎРѓР ВµРЎР‚Р Р†Р ВµРЎР‚ Р Р…Р Вµ Р С—Р В°Р Т‘РЎвЂљРЎР‚РЎвЂ№Р С?Р В»РЎвЂ“Р Р†Р В°Р ВµРЎвЂ РЎвЂ Р В°.';
$PHPMAILER_LANG['recipients_failed']    = 'Р СџР В°Р С?РЎвЂ№Р В»Р С”Р В° SMTP: Р Р…РЎРЏР С—РЎР‚Р В°Р Р†РЎвЂ“Р В»РЎРЉР Р…РЎвЂ№РЎРЏ Р В°РЎвЂљРЎР‚РЎвЂ№Р С?Р В°Р В»РЎРЉР Р…РЎвЂ“Р С”РЎвЂ“: ';
$PHPMAILER_LANG['signing']              = 'Р СџР В°Р С?РЎвЂ№Р В»Р С”Р В° Р С—Р С•Р Т‘Р С—РЎвЂ“РЎРѓРЎС“ Р С—Р В°Р Р†Р ВµР Т‘Р В°Р С?Р В»Р ВµР Р…Р Р…РЎРЏ: ';
$PHPMAILER_LANG['smtp_connect_failed']  = 'Р СџР В°Р С?РЎвЂ№Р В»Р С”Р В° РЎРѓРЎС“Р Р†РЎРЏР В·РЎвЂ“ Р В· SMTP-РЎРѓР ВµРЎР‚Р Р†Р ВµРЎР‚Р В°Р С?.';
$PHPMAILER_LANG['smtp_error']           = 'Р СџР В°Р С?РЎвЂ№Р В»Р С”Р В° SMTP: ';
$PHPMAILER_LANG['variable_set']         = 'Р СњР ВµР В»РЎРЉР С–Р В° РЎС›РЎРѓРЎвЂљР В°Р Р…Р В°Р Р†РЎвЂ“РЎвЂ РЎРЉ Р В°Р В±Р С• Р С—Р ВµРЎР‚Р В°Р С?РЎРЏР Р…РЎвЂ“РЎвЂ РЎРЉ Р В·Р Р…Р В°РЎвЂЎРЎРЊР Р…Р Р…Р Вµ Р С—Р ВµРЎР‚Р В°Р С?Р ВµР Р…Р Р…Р В°Р в„–: ';
//$PHPMAILER_LANG['extension_missing']    = 'Extension missing: ';
