<?php
/**
 * Ukrainian PHPMailer language file: refer to English translation for definitive list
 * @package PHPMailer
 * @author Yuriy Rudyy <yrudyy@prs.net.ua>
 * @fixed by Boris Yurchenko <boris@yurchenko.pp.ua>
 */

$PHPMAILER_LANG['authenticate']         = 'Р СџР С•Р С?Р С‘Р В»Р С”Р В° SMTP: Р С—Р С•Р С?Р С‘Р В»Р С”Р В° Р В°Р Р†РЎвЂљР С•РЎР‚Р С‘Р В·Р В°РЎвЂ РЎвЂ“РЎвЂ”.';
$PHPMAILER_LANG['connect_host']         = 'Р СџР С•Р С?Р С‘Р В»Р С”Р В° SMTP: Р Р…Р Вµ Р Р†Р Т‘Р В°РЎвЂќРЎвЂљРЎРЉРЎРѓРЎРЏ Р С—РЎвЂ“Р Т‘\'РЎвЂќР Т‘Р Р…Р В°РЎвЂљР С‘РЎРѓРЎРЏ Р Т‘Р С• РЎРѓР ВµРЎР‚Р Р†Р ВµРЎР‚РЎС“ SMTP.';
$PHPMAILER_LANG['data_not_accepted']    = 'Р СџР С•Р С?Р С‘Р В»Р С”Р В° SMTP: Р Т‘Р В°Р Р…РЎвЂ“ Р Р…Р Вµ Р С—РЎР‚Р С‘Р в„–Р Р…РЎРЏРЎвЂљРЎвЂ“.';
$PHPMAILER_LANG['encoding']             = 'Р СњР ВµР Р†РЎвЂ“Р Т‘Р С•Р С?Р С‘Р в„– РЎвЂљР С‘Р С— Р С”Р С•Р Т‘РЎС“Р Р†Р В°Р Р…Р Р…РЎРЏ: ';
$PHPMAILER_LANG['execute']              = 'Р СњР ВµР С?Р С•Р В¶Р В»Р С‘Р Р†Р С• Р Р†Р С‘Р С”Р С•Р Р…Р В°РЎвЂљР С‘ Р С”Р С•Р С?Р В°Р Р…Р Т‘РЎС“: ';
$PHPMAILER_LANG['file_access']          = 'Р СњР ВµР С?Р В°РЎвЂќ Р Т‘Р С•РЎРѓРЎвЂљРЎС“Р С—РЎС“ Р Т‘Р С• РЎвЂћР В°Р в„–Р В»РЎС“: ';
$PHPMAILER_LANG['file_open']            = 'Р СџР С•Р С?Р С‘Р В»Р С”Р В° РЎвЂћР В°Р в„–Р В»Р С•Р Р†Р С•РЎвЂ” РЎРѓР С‘РЎРѓРЎвЂљР ВµР С?Р С‘: Р Р…Р Вµ Р Р†Р Т‘Р В°РЎвЂќРЎвЂљРЎРЉРЎРѓРЎРЏ Р Р†РЎвЂ“Р Т‘Р С”РЎР‚Р С‘РЎвЂљР С‘ РЎвЂћР В°Р в„–Р В»: ';
$PHPMAILER_LANG['from_failed']          = 'Р СњР ВµР Р†РЎвЂ“РЎР‚Р Р…Р В° Р В°Р Т‘РЎР‚Р ВµРЎРѓР В° Р Р†РЎвЂ“Р Т‘Р С—РЎР‚Р В°Р Р†Р Р…Р С‘Р С”Р В°: ';
$PHPMAILER_LANG['instantiate']          = 'Р СњР ВµР С?Р С•Р В¶Р В»Р С‘Р Р†Р С• Р В·Р В°Р С—РЎС“РЎРѓРЎвЂљР С‘РЎвЂљР С‘ РЎвЂћРЎС“Р Р…Р С”РЎвЂ РЎвЂ“РЎР‹ mail.';
$PHPMAILER_LANG['provide_address']      = 'Р вЂ?РЎС“Р Т‘РЎРЉ-Р В»Р В°РЎРѓР С”Р В°, Р Р†Р Р†Р ВµР Т‘РЎвЂ“РЎвЂљРЎРЉ РЎвЂ¦Р С•РЎвЂЎР В° Р В± Р С•Р Т‘Р Р…РЎС“ Р В°Р Т‘РЎР‚Р ВµРЎРѓРЎС“ e-mail Р С•РЎвЂљРЎР‚Р С‘Р С?РЎС“Р Р†Р В°РЎвЂЎР В°.';
$PHPMAILER_LANG['mailer_not_supported'] = ' - Р С—Р С•РЎв‚¬РЎвЂљР С•Р Р†Р С‘Р в„– РЎРѓР ВµРЎР‚Р Р†Р ВµРЎР‚ Р Р…Р Вµ Р С—РЎвЂ“Р Т‘РЎвЂљРЎР‚Р С‘Р С?РЎС“РЎвЂќРЎвЂљРЎРЉРЎРѓРЎРЏ.';
$PHPMAILER_LANG['recipients_failed']    = 'Р СџР С•Р С?Р С‘Р В»Р С”Р В° SMTP: Р Р†РЎвЂ“Р Т‘Р С—РЎР‚Р В°Р Р†Р В»Р ВµР Р…Р Р…РЎРЏ Р Р…Р В°РЎРѓРЎвЂљРЎС“Р С—Р Р…Р С‘Р С? Р С•РЎвЂљРЎР‚Р С‘Р С?РЎС“Р Р†Р В°РЎвЂЎР В°Р С? Р Р…Р Вµ Р Р†Р Т‘Р В°Р В»Р С•РЎРѓРЎРЏ: ';
$PHPMAILER_LANG['empty_message']        = 'Р СџРЎС“РЎРѓРЎвЂљР Вµ РЎвЂљРЎвЂ“Р В»Р С• Р С—Р С•Р Р†РЎвЂ“Р Т‘Р С•Р С?Р В»Р ВµР Р…Р Р…РЎРЏ';
$PHPMAILER_LANG['invalid_address']      = 'Р СњР Вµ Р Р†РЎвЂ“Р Т‘Р С—РЎР‚Р В°Р Р†Р В»Р ВµР Р…Р С•, Р Р…Р ВµР Р†РЎвЂ“РЎР‚Р Р…Р С‘Р в„– РЎвЂћР С•РЎР‚Р С?Р В°РЎвЂљ Р В°Р Т‘РЎР‚Р ВµРЎРѓР С‘ e-mail: ';
$PHPMAILER_LANG['signing']              = 'Р СџР С•Р С?Р С‘Р В»Р С”Р В° Р С—РЎвЂ“Р Т‘Р С—Р С‘РЎРѓРЎС“: ';
$PHPMAILER_LANG['smtp_connect_failed']  = 'Р СџР С•Р С?Р С‘Р В»Р С”Р В° Р В·\'РЎвЂќР Т‘Р Р…Р В°Р Р…Р Р…РЎРЏ РЎвЂ“Р В· SMTP-РЎРѓР ВµРЎР‚Р Р†Р ВµРЎР‚Р С•Р С?';
$PHPMAILER_LANG['smtp_error']           = 'Р СџР С•Р С?Р С‘Р В»Р С”Р В° SMTP-РЎРѓР ВµРЎР‚Р Р†Р ВµРЎР‚Р В°: ';
$PHPMAILER_LANG['variable_set']         = 'Р СњР ВµР С?Р С•Р В¶Р В»Р С‘Р Р†Р С• Р Р†РЎРѓРЎвЂљР В°Р Р…Р С•Р Р†Р С‘РЎвЂљР С‘ Р В°Р В±Р С• Р С—Р ВµРЎР‚Р ВµР Р†РЎРѓРЎвЂљР В°Р Р…Р С•Р Р†Р С‘РЎвЂљР С‘ Р В·Р С?РЎвЂ“Р Р…Р Р…РЎС“: ';
//$PHPMAILER_LANG['extension_missing']    = 'Extension missing: ';
