<?php
/**
 * Serbian PHPMailer language file: refer to English translation for definitive list
 * @package PHPMailer
 * @author Р С’Р В»Р ВµР С”РЎРѓР В°Р Р…Р Т‘Р В°РЎР‚ Р в‚¬Р ВµР Р†РЎР‚Р ВµР С?Р С•Р Р†Р С‘РЎвЂє <ajevremovic@gmail.com>
 */

$PHPMAILER_LANG['authenticate']         = 'SMTP Р С–РЎР‚Р ВµРЎв‚¬Р С”Р В°: Р В°РЎС“РЎвЂљР ВµР Р…РЎвЂљР С‘РЎвЂћР С‘Р С”Р В°РЎвЂ Р С‘РЎ?Р В° Р Р…Р С‘РЎ?Р Вµ РЎС“РЎРѓР С—Р ВµР В»Р В°.';
$PHPMAILER_LANG['connect_host']         = 'SMTP Р С–РЎР‚Р ВµРЎв‚¬Р С”Р В°: Р Р…Р С‘РЎ?Р Вµ Р С?Р С•Р С–РЎС“РЎвЂєР Вµ Р С—Р С•Р Р†Р ВµР В·Р С‘Р Р†Р В°РЎС™Р Вµ РЎРѓР В° SMTP РЎРѓР ВµРЎР‚Р Р†Р ВµРЎР‚Р С•Р С?.';
$PHPMAILER_LANG['data_not_accepted']    = 'SMTP Р С–РЎР‚Р ВµРЎв‚¬Р С”Р В°: Р С—Р С•Р Т‘Р В°РЎвЂ Р С‘ Р Р…Р С‘РЎРѓРЎС“ Р С—РЎР‚Р С‘РЎвЂ¦Р Р†Р В°РЎвЂєР ВµР Р…Р С‘.';
$PHPMAILER_LANG['empty_message']        = 'Р РЋР В°Р Т‘РЎР‚Р В¶Р В°РЎ? Р С—Р С•РЎР‚РЎС“Р С”Р Вµ РЎ?Р Вµ Р С—РЎР‚Р В°Р В·Р В°Р Р….';
$PHPMAILER_LANG['encoding']             = 'Р СњР ВµР С—Р С•Р В·Р Р…Р В°РЎвЂљР С• Р С”Р С•Р Т‘Р С•Р Р†Р В°РЎС™Р Вµ: ';
$PHPMAILER_LANG['execute']              = 'Р СњР С‘РЎ?Р Вµ Р С?Р С•Р С–РЎС“РЎвЂєР Вµ Р С‘Р В·Р Р†РЎР‚РЎв‚¬Р С‘РЎвЂљР С‘ Р Р…Р В°РЎР‚Р ВµР Т‘Р В±РЎС“: ';
$PHPMAILER_LANG['file_access']          = 'Р СњР С‘РЎ?Р Вµ Р С?Р С•Р С–РЎС“РЎвЂєР Вµ Р С—РЎР‚Р С‘РЎРѓРЎвЂљРЎС“Р С—Р С‘РЎвЂљР С‘ Р Т‘Р В°РЎвЂљР С•РЎвЂљР ВµРЎвЂ Р С‘: ';
$PHPMAILER_LANG['file_open']            = 'Р СњР С‘РЎ?Р Вµ Р С?Р С•Р С–РЎС“РЎвЂєР Вµ Р С•РЎвЂљР Р†Р С•РЎР‚Р С‘РЎвЂљР С‘ Р Т‘Р В°РЎвЂљР С•РЎвЂљР ВµР С”РЎС“: ';
$PHPMAILER_LANG['from_failed']          = 'SMTP Р С–РЎР‚Р ВµРЎв‚¬Р С”Р В°: РЎРѓР В»Р В°РЎС™Р Вµ РЎРѓР В° РЎРѓР В»Р ВµР Т‘Р ВµРЎвЂєР С‘РЎвЂ¦ Р В°Р Т‘РЎР‚Р ВµРЎРѓР В° Р Р…Р С‘РЎ?Р Вµ РЎС“РЎРѓР С—Р ВµР В»Р С•: ';
$PHPMAILER_LANG['recipients_failed']    = 'SMTP Р С–РЎР‚Р ВµРЎв‚¬Р С”Р В°: РЎРѓР В»Р В°РЎС™Р Вµ Р Р…Р В° РЎРѓР В»Р ВµР Т‘Р ВµРЎвЂєР Вµ Р В°Р Т‘РЎР‚Р ВµРЎРѓР Вµ Р Р…Р С‘РЎ?Р Вµ РЎС“РЎРѓР С—Р ВµР В»Р С•: ';
$PHPMAILER_LANG['instantiate']          = 'Р СњР С‘РЎ?Р Вµ Р С?Р С•Р С–РЎС“РЎвЂєР Вµ Р С—Р С•Р С”РЎР‚Р ВµР Р…РЎС“РЎвЂљР С‘ mail РЎвЂћРЎС“Р Р…Р С”РЎвЂ Р С‘РЎ?РЎС“.';
$PHPMAILER_LANG['invalid_address']      = 'Р СџР С•РЎР‚РЎС“Р С”Р В° Р Р…Р С‘РЎ?Р Вµ Р С—Р С•РЎРѓР В»Р В°РЎвЂљР В° Р В·Р В±Р С•Р С– Р Р…Р ВµР С‘РЎРѓР С—РЎР‚Р В°Р Р†Р Р…Р Вµ Р В°Р Т‘РЎР‚Р ВµРЎРѓР Вµ: ';
$PHPMAILER_LANG['mailer_not_supported'] = ' Р С?Р ВµРЎ?Р В»Р ВµРЎР‚ Р Р…Р С‘РЎ?Р Вµ Р С—Р С•Р Т‘РЎР‚Р В¶Р В°Р Р….';
$PHPMAILER_LANG['provide_address']      = 'Р СџР С•РЎвЂљРЎР‚Р ВµР В±Р Р…Р С• РЎ?Р Вµ Р В·Р В°Р Т‘Р В°РЎвЂљР С‘ Р Р…Р В°РЎ?Р С?Р В°РЎС™Р Вµ РЎ?Р ВµР Т‘Р Р…РЎС“ Р В°Р Т‘РЎР‚Р ВµРЎРѓРЎС“.';
$PHPMAILER_LANG['signing']              = 'Р вЂњРЎР‚Р ВµРЎв‚¬Р С”Р В° Р С—РЎР‚Р С‘Р В»Р С‘Р С”Р С•Р С? Р С—РЎР‚Р С‘РЎ?Р В°Р Р†РЎв„ўР С‘Р Р†Р В°РЎС™Р В°: ';
$PHPMAILER_LANG['smtp_connect_failed']  = 'Р СџР С•Р Р†Р ВµР В·Р С‘Р Р†Р В°РЎС™Р Вµ РЎРѓР В° SMTP РЎРѓР ВµРЎР‚Р Р†Р ВµРЎР‚Р С•Р С? Р Р…Р С‘РЎ?Р Вµ РЎС“РЎРѓР С—Р ВµР В»Р С•.';
$PHPMAILER_LANG['smtp_error']           = 'Р вЂњРЎР‚Р ВµРЎв‚¬Р С”Р В° SMTP РЎРѓР ВµРЎР‚Р Р†Р ВµРЎР‚Р В°: ';
$PHPMAILER_LANG['variable_set']         = 'Р СњР С‘РЎ?Р Вµ Р С?Р С•Р С–РЎС“РЎвЂєР Вµ Р В·Р В°Р Т‘Р В°РЎвЂљР С‘ Р С—РЎР‚Р С•Р С?Р ВµР Р…РЎв„ўР С‘Р Р†РЎС“, Р Р…Р С‘РЎвЂљР С‘ РЎ?Р Вµ Р Р†РЎР‚Р В°РЎвЂљР С‘РЎвЂљР С‘ РЎС“Р Р…Р В°Р В·Р В°Р Т‘: ';
//$PHPMAILER_LANG['extension_missing']    = 'Extension missing: ';
