<?php
/**
 * Korean PHPMailer language file: refer to English translation for definitive list
 * @package PHPMailer
 * @author ChalkPE <amato0617@gmail.com>
 */

$PHPMAILER_LANG['authenticate']         = 'SMTP Рј?В¤Р»Тђ?: РјСњС‘РјВ¦СњРЅвЂўВ  Рјв‚¬? РјвЂ”вЂ РјР‰ВµР»вЂ№в‚¬Р»вЂ№В¤.';
$PHPMAILER_LANG['connect_host']         = 'SMTP Рј?В¤Р»Тђ?: SMTP РЅ?С‘РјР‰В¤РЅР‰С‘РјвЂ”С’ РјВ вЂ?РјвЂ РЊРЅвЂўВ  Рјв‚¬? РјвЂ”вЂ РјР‰ВµР»вЂ№в‚¬Р»вЂ№В¤.';
$PHPMAILER_LANG['data_not_accepted']    = 'SMTP Рј?В¤Р»Тђ?: Р»РЊВ°РјСњТ‘РЅвЂћВ°РєВ°Р‚ Р»В°вЂєРјвЂўвЂћР»вЂњВ¤РјвЂ”В¬РјВ§Р‚РјВ§Р‚ РјвЂўР‰РјвЂў?РјР‰ВµР»вЂ№в‚¬Р»вЂ№В¤.';
$PHPMAILER_LANG['empty_message']        = 'Р»В©вЂќРјвЂћС‘РјВ§Р‚ Р»вЂљТ‘РјС™В©РјСњТ‘ РјвЂ”вЂ РјР‰ВµР»вЂ№в‚¬Р»вЂ№В¤';
$PHPMAILER_LANG['encoding']             = 'РјвЂўРЉ Рјв‚¬? РјвЂ”вЂ Р»Р‰вЂќ РјСњС‘РјР…вЂќР»вЂќВ©: ';
$PHPMAILER_LANG['execute']              = 'РјвЂ№В¤РЅвЂ“вЂ° Р»В¶в‚¬РєВ°Р‚: ';
$PHPMAILER_LANG['file_access']          = 'РЅРЉРЉРјСњС? РјВ вЂ?РєВ·С? Р»В¶в‚¬РєВ°Р‚: ';
$PHPMAILER_LANG['file_open']            = 'РЅРЉРЉРјСњС? Рј?В¤Р»Тђ?: РЅРЉРЉРјСњС?РјСњвЂћ РјвЂ”Т‘ Рјв‚¬? РјвЂ”вЂ РјР‰ВµР»вЂ№в‚¬Р»вЂ№В¤: ';
$PHPMAILER_LANG['from_failed']          = 'Р»вЂ№В¤РјСњРЉ From РјР€С?РјвЂ РЉРјвЂ”С’РјвЂћСљ Рј?В¤Р»Тђ?РєВ°Р‚ Р»В°СљРјС“СњРЅвЂ“в‚¬РјР‰ВµР»вЂ№в‚¬Р»вЂ№В¤: ';
$PHPMAILER_LANG['instantiate']          = 'mail РЅвЂўРЃРјв‚¬?Р»ТђС? РјСњС‘РјР‰В¤РЅвЂћТ‘РјР‰В¤РЅв„ўвЂќРЅвЂўВ  Рјв‚¬? РјвЂ”вЂ РјР‰ВµР»вЂ№в‚¬Р»вЂ№В¤';
$PHPMAILER_LANG['invalid_address']      = 'РјС›?Р»Р„В»Р»С’Сљ РјР€С?РјвЂ РЉ: ';
$PHPMAILER_LANG['mailer_not_supported'] = ' Р»В©вЂќРјСњС?Р»СџВ¬Р»Р‰вЂќ РјВ§Р‚РјвЂєС’Р»С’?РјВ§Р‚ РјвЂўР‰РјР‰ВµР»вЂ№в‚¬Р»вЂ№В¤.';
$PHPMAILER_LANG['provide_address']      = 'РјВ РѓРјвЂ“Т‘Р»РЏвЂћ РЅвЂўСљ РєВ°Сљ РјСњТ‘РјС“РѓРјСњ? Рјв‚¬?РјвЂ№В РјС›С’ Р»В©вЂќРјСњС? РјР€С?РјвЂ РЉР»ТђС? РјВ СљРєС–ВµРЅвЂўТ‘РјвЂўС? РЅвЂўВ©Р»вЂ№в‚¬Р»вЂ№В¤.';
$PHPMAILER_LANG['recipients_failed']    = 'SMTP Рј?В¤Р»Тђ?: Р»вЂ№В¤РјСњРЉ Рјв‚¬?РјвЂ№В РјС›С’РјвЂ”С’РјвЂћСљ Рј?В¤Р»Тђ?РєВ°Р‚ Р»В°СљРјС“СњРЅвЂ“в‚¬РјР‰ВµР»вЂ№в‚¬Р»вЂ№В¤: ';
$PHPMAILER_LANG['signing']              = 'РјвЂћСљР»Р„вЂ¦ Рј?В¤Р»Тђ?: ';
$PHPMAILER_LANG['smtp_connect_failed']  = 'SMTP РјвЂ”В°РєР†В°РјСњвЂћ РјвЂ№В¤РЅРЉРЃРЅвЂў?Рј?Р‚РјР‰ВµР»вЂ№в‚¬Р»вЂ№В¤.';
$PHPMAILER_LANG['smtp_error']           = 'SMTP РјвЂћСљР»Р†вЂћ Рј?В¤Р»Тђ?: ';
$PHPMAILER_LANG['variable_set']         = 'Р»С–Р‚Рјв‚¬? РјвЂћВ¤РјВ вЂў Р»В°РЏ РјТ‘в‚¬РєС‘В°РЅв„ўвЂќ Р»В¶в‚¬РєВ°Р‚: ';
$PHPMAILER_LANG['extension_missing']    = 'РЅв„ўвЂўРјС›ТђРјС›С’ РјвЂ”вЂ РјСњРЉ: ';
