<?php
/**
 * Armenian PHPMailer language file: refer to English translation for definitive list
 * @package PHPMailer
 * @author Hrayr Grigoryan <hrayr@bits.am>
 */
 
$PHPMAILER_LANG['authenticate']         = 'SMTP -РҐВ« РҐР…РҐВ­РҐРЋРҐВ¬: РҐв„–РҐВ°РҐРЋРҐВ»РҐС‘РҐР†РҐС•РҐТђР¦Рѓ РҐР…РҐС—РҐС‘Р¦вЂљРҐР€РҐТђРҐВ¬ РҐВ«РҐР…РҐР‡РҐС‘Р¦вЂљРҐВ©РҐВµРҐС‘Р¦вЂљРҐВ¶РҐРЃ.';
$PHPMAILER_LANG['connect_host']         = 'SMTP -РҐВ« РҐР…РҐВ­РҐРЋРҐВ¬: РҐв„–РҐВ°РҐРЋРҐВ»РҐС‘РҐР†РҐС•РҐТђР¦Рѓ РҐР‡РҐРЋРҐС” РҐВ°РҐРЋРҐР…РҐС—РҐРЋРҐС—РҐТђРҐВ¬ SMTP РҐР…РҐТђР¦Р‚РҐС•РҐТђР¦Р‚РҐВ« РҐВ°РҐТђРҐС—.';
$PHPMAILER_LANG['data_not_accepted']    = 'SMTP -РҐВ« РҐР…РҐВ­РҐРЋРҐВ¬: РҐС—РҐС•РҐВµРҐРЋРҐВ¬РҐВ¶РҐТђР¦Р‚РҐРЃ РҐРЃРҐВ¶РҐВ¤РҐС‘Р¦вЂљРҐВ¶РҐС•РҐРЋРҐВ® РҐв„–РҐТђРҐВ¶.';
$PHPMAILER_LANG['empty_message']        = 'РҐР‚РҐРЋРҐР†РҐС‘Р¦Р‚РҐВ¤РҐРЋРҐР€Р¦Р‚РҐС‘Р¦вЂљРҐВ©РҐВµРҐС‘Р¦вЂљРҐВ¶РҐРЃ РҐВ¤РҐРЋРҐС—РҐРЋР¦Р‚РҐР‡ РҐВ§';
$PHPMAILER_LANG['encoding']             = 'Р¤С—РҐС‘РҐВ¤РҐРЋРҐС•РҐС‘Р¦Р‚РҐТ‘РҐРЋРҐВ¶ РҐРЋРҐВ¶РҐВ°РҐРЋРҐВµРҐС— РҐС—РҐТђРҐР…РҐРЋРҐР‡: ';
$PHPMAILER_LANG['execute']              = 'РҐвЂ°РҐВ°РҐРЋРҐВ»РҐС‘РҐР†РҐС•РҐТђР¦Рѓ РҐВ«Р¦Р‚РҐРЋРҐР‡РҐРЋРҐВ¶РҐРЋР¦РѓРҐВ¶РҐТђРҐВ¬ РҐВ°Р¦Р‚РҐРЋРҐТ‘РҐРЋРҐВ¶РҐРЃ: ';
$PHPMAILER_LANG['file_access']          = 'РҐвЂ“РҐРЋРҐВµРҐВ¬РҐРЃ РҐВ°РҐРЋРҐР…РҐРЋРҐВ¶РҐТђРҐВ¬РҐВ« РҐв„–РҐВ§: ';
$PHPMAILER_LANG['file_open']            = 'РҐвЂ“РҐРЋРҐВµРҐВ¬РҐВ« РҐР…РҐВ­РҐРЋРҐВ¬: Р¦вЂ РҐРЋРҐВµРҐВ¬РҐРЃ РҐв„–РҐВ°РҐРЋРҐВ»РҐС‘РҐР†РҐС•РҐТђР¦Рѓ РҐСћРҐРЋР¦РѓРҐТђРҐВ¬: ';
$PHPMAILER_LANG['from_failed']          = 'РҐв‚¬Р¦вЂљРҐР†РҐРЋР¦Р‚РҐР‡РҐС‘РҐР†РҐВ« РҐВ°РҐТђРҐС—Р¦вЂЎРҐВµРҐРЋРҐВ¬ РҐВ°РҐРЋРҐР…Р¦РѓРҐТђРҐВ¶ РҐР…РҐВ­РҐРЋРҐВ¬ РҐВ§: ';
$PHPMAILER_LANG['instantiate']          = 'РҐР‚РҐВ¶РҐРЋР¦Р‚РҐРЋРҐС•РҐС‘Р¦Р‚ РҐв„–РҐВ§ РҐР‡РҐРЋРҐВ¶РҐв„–РҐТђРҐВ¬ mail Р¦вЂ РҐС‘Р¦вЂљРҐВ¶РҐР‡Р¦РѓРҐВ«РҐРЋРҐВ¶.';
$PHPMAILER_LANG['invalid_address']      = 'РҐР‚РҐРЋРҐР…Р¦РѓРҐТђРҐВ¶ РҐР…РҐВ­РҐРЋРҐВ¬ РҐВ§: ';
$PHPMAILER_LANG['mailer_not_supported'] = ' Р¦С“РҐС‘РҐР…РҐС—РҐРЋРҐВµРҐВ«РҐВ¶ РҐР…РҐТђР¦Р‚РҐС•РҐТђР¦Р‚РҐВ« РҐВ°РҐТђРҐС— РҐв„–РҐВ« РҐРЋРҐВ·РҐВ­РҐРЋРҐС—РҐС‘Р¦вЂљРҐТ‘.';
$PHPMAILER_LANG['provide_address']      = 'Р¤В±РҐВ¶РҐВ°Р¦Р‚РҐРЋРҐР„РҐТђРҐВ·РҐС— РҐВ§ РҐС—Р¦Р‚РҐРЋРҐТ‘РҐРЋРҐВ¤Р¦Р‚РҐТђРҐВ¬ РҐР€РҐС‘РҐВ¶РҐТђ РҐТ‘РҐТђРҐР‡ РҐР…РҐС—РҐРЋР¦РѓРҐС‘РҐР†РҐВ« e-mail РҐВ°РҐРЋРҐР…Р¦РѓРҐТђ.';
$PHPMAILER_LANG['recipients_failed']    = 'SMTP -РҐВ« РҐР…РҐВ­РҐРЋРҐВ¬: РҐв„–РҐВ« РҐВ°РҐРЋРҐВ»РҐС‘РҐР†РҐС•РҐТђРҐВ¬ РҐС‘Р¦вЂљРҐР†РҐРЋР¦Р‚РҐР‡РҐТђРҐВ¬ РҐВ°РҐТђРҐС—Р¦вЂЎРҐВµРҐРЋРҐВ¬ РҐР…РҐС—РҐРЋР¦РѓРҐС‘РҐР†РҐВ¶РҐТђР¦Р‚РҐВ« РҐВ°РҐРЋРҐР…Р¦РѓРҐТђРҐВ¶РҐТђР¦Р‚РҐВ«РҐВ¶: ';
$PHPMAILER_LANG['signing']              = 'РҐРЊРҐС—РҐС‘Р¦Р‚РҐРЋРҐР€Р¦Р‚РҐТ‘РҐРЋРҐВ¶ РҐР…РҐВ­РҐРЋРҐВ¬: ';
$PHPMAILER_LANG['smtp_connect_failed']  = 'SMTP -РҐВ« connect() Р¦вЂ РҐС‘Р¦вЂљРҐВ¶РҐР‡Р¦РѓРҐВ«РҐРЋРҐВ¶ РҐв„–РҐВ« РҐВ°РҐРЋРҐВ»РҐС‘РҐР†РҐС•РҐТђРҐВ¬';
$PHPMAILER_LANG['smtp_error']           = 'SMTP РҐР…РҐТђР¦Р‚РҐС•РҐТђР¦Р‚РҐВ« РҐР…РҐВ­РҐРЋРҐВ¬: ';
$PHPMAILER_LANG['variable_set']         = 'РҐвЂ°РҐВ« РҐВ°РҐРЋРҐВ»РҐС‘РҐР†РҐС•РҐС‘Р¦вЂљРҐТ‘ РҐР…РҐС—РҐТђРҐР†РҐВ®РҐТђРҐВ¬ РҐР‡РҐРЋРҐТ‘ РҐС•РҐТђР¦Р‚РҐРЋР¦С“РҐС‘РҐВ­РҐТђРҐВ¬ Р¦С“РҐС‘Р¦С“РҐС‘РҐВ­РҐРЋРҐР‡РҐРЋРҐВ¶РҐРЃ: ';
$PHPMAILER_LANG['extension_missing']    = 'РҐР‚РҐРЋРҐС•РҐТђРҐВ¬РҐС•РҐРЋРҐВ®РҐРЃ РҐСћРҐРЋР¦РѓРҐРЋРҐР‡РҐРЋРҐВµРҐС‘Р¦вЂљРҐТ‘ РҐВ§: ';
