<?php
/**
 * Hebrew PHPMailer language file: refer to English translation for definitive list
 * @package PHPMailer
 * @author Ronny Sherer <ronny@hoojima.com>
 */

$PHPMAILER_LANG['authenticate']         = 'Р§В©Р§вЂ™Р§в„ўР§С’Р§Р„ SMTP: Р§В¤Р§СћР§вЂўР§СљР§Р„ Р§вЂќР§С’Р§в„ўР§С›Р§вЂўР§Р„ Р§В Р§вЂєР§В©Р§СљР§вЂќ.';
$PHPMAILER_LANG['connect_host']         = 'Р§В©Р§вЂ™Р§в„ўР§С’Р§Р„ SMTP: Р§СљР§С’ Р§вЂќР§В¦Р§СљР§вЂ”Р§Р„Р§в„ў Р§СљР§вЂќР§Р„Р§вЂ”Р§вЂ?Р§РЃ Р§СљР§В©Р§РЃР§Р„ SMTP.';
$PHPMAILER_LANG['data_not_accepted']    = 'Р§В©Р§вЂ™Р§в„ўР§С’Р§Р„ SMTP: Р§С›Р§в„ўР§вЂњР§Сћ Р§СљР§С’ Р§вЂќР§Р„Р§В§Р§вЂ?Р§Сљ.';
$PHPMAILER_LANG['empty_message']        = 'Р§вЂ™Р§вЂўР§Р€ Р§вЂќР§вЂќР§вЂўР§вЂњР§СћР§вЂќ Р§РЃР§в„ўР§В§';
$PHPMAILER_LANG['invalid_address']      = 'Р§вЂєР§Р„Р§вЂўР§вЂ?Р§Р„ Р§В©Р§вЂ™Р§вЂўР§в„ўР§вЂќ: ';
$PHPMAILER_LANG['encoding']             = 'Р§В§Р§в„ўР§вЂњР§вЂўР§вЂњ Р§СљР§С’ Р§С›Р§вЂўР§вЂєР§РЃ: ';
$PHPMAILER_LANG['execute']              = 'Р§СљР§С’ Р§вЂќР§В¦Р§СљР§вЂ”Р§Р„Р§в„ў Р§СљР§вЂќР§В¤Р§СћР§в„ўР§Сљ Р§С’Р§Р„: ';
$PHPMAILER_LANG['file_access']          = 'Р§СљР§С’ Р§В Р§в„ўР§Р„Р§Сџ Р§СљР§вЂ™Р§В©Р§Р„ Р§СљР§В§Р§вЂўР§вЂ?Р§Тђ: ';
$PHPMAILER_LANG['file_open']            = 'Р§В©Р§вЂ™Р§в„ўР§С’Р§Р„ Р§В§Р§вЂўР§вЂ?Р§Тђ: Р§СљР§С’ Р§В Р§в„ўР§Р„Р§Сџ Р§СљР§вЂ™Р§В©Р§Р„ Р§СљР§В§Р§вЂўР§вЂ?Р§Тђ: ';
$PHPMAILER_LANG['from_failed']          = 'Р§вЂєР§Р„Р§вЂўР§вЂ?Р§вЂўР§Р„ Р§вЂќР§В Р§С›Р§СћР§В Р§в„ўР§Сњ Р§вЂќР§вЂ?Р§С’Р§вЂўР§Р„ Р§В Р§вЂєР§В©Р§СљР§вЂў: ';
$PHPMAILER_LANG['instantiate']          = 'Р§СљР§С’ Р§вЂќР§В¦Р§СљР§вЂ”Р§Р„Р§в„ў Р§СљР§вЂќР§В¤Р§СћР§в„ўР§Сљ Р§С’Р§Р„ Р§В¤Р§вЂўР§В Р§В§Р§В¦Р§в„ўР§в„ўР§Р„ Р§вЂќР§С›Р§в„ўР§в„ўР§Сљ.';
$PHPMAILER_LANG['mailer_not_supported'] = ' Р§С’Р§в„ўР§В Р§вЂќ Р§В Р§Р„Р§С›Р§вЂєР§Р„.';
$PHPMAILER_LANG['provide_address']      = 'Р§вЂ”Р§вЂўР§вЂ?Р§вЂќ Р§СљР§РЋР§В¤Р§В§ Р§СљР§В¤Р§вЂ”Р§вЂўР§Р„ Р§вЂєР§Р„Р§вЂўР§вЂ?Р§Р„ Р§С’Р§вЂ”Р§Р„ Р§В©Р§Сљ Р§С›Р§В§Р§вЂ?Р§Сљ Р§вЂќР§С›Р§в„ўР§в„ўР§Сљ.';
$PHPMAILER_LANG['recipients_failed']    = 'Р§В©Р§вЂ™Р§в„ўР§С’Р§Р„ SMTP: Р§вЂќР§В Р§С›Р§СћР§В Р§в„ўР§Сњ Р§вЂќР§вЂ?Р§С’Р§в„ўР§Сњ Р§В Р§вЂєР§В©Р§СљР§вЂў: ';
$PHPMAILER_LANG['signing']              = 'Р§В©Р§вЂ™Р§в„ўР§С’Р§Р„ Р§вЂ”Р§Р„Р§в„ўР§С›Р§вЂќ: ';
$PHPMAILER_LANG['smtp_connect_failed']  = 'SMTP Connect() failed.';
$PHPMAILER_LANG['smtp_error']           = 'Р§В©Р§вЂ™Р§в„ўР§С’Р§Р„ Р§В©Р§РЃР§Р„ SMTP: ';
$PHPMAILER_LANG['variable_set']         = 'Р§СљР§С’ Р§В Р§в„ўР§Р„Р§Сџ Р§СљР§В§Р§вЂ?Р§вЂўР§Сћ Р§С’Р§вЂў Р§СљР§В©Р§В Р§вЂўР§Р„ Р§С’Р§Р„ Р§вЂќР§С›Р§В©Р§Р„Р§В Р§вЂќ: ';
//$PHPMAILER_LANG['extension_missing']    = 'Extension missing: ';
