<?php
/**
 * Georgian PHPMailer language file: refer to English translation for definitive list
 * @package PHPMailer
 * @author Avtandil Kikabidze aka LONGMAN <akalongman@gmail.com>
 */

$PHPMAILER_LANG['authenticate']         = 'SMTP Р±С“РЃР±С“вЂќР±С“Р„Р±С“вЂњР±С“СњР±С“вЂєР±С“С’: Р±С“С’Р±С“вЂўР±С“СћР±С“СњР±С“В Р±С“?Р±С“вЂ“Р±С“С’Р±С“Р„Р±С“?Р±С“С’ Р±С“РЃР±С“вЂќР±С“Р€Р±С“В«Р±С“С™Р±С“вЂќР±С“вЂ?Р±С“вЂќР±С“С™Р±С“?Р±С“С’.';
$PHPMAILER_LANG['connect_host']         = 'SMTP Р±С“РЃР±С“вЂќР±С“Р„Р±С“вЂњР±С“СњР±С“вЂєР±С“С’: SMTP Р±С“РЋР±С“вЂќР±С“В Р±С“вЂўР±С“вЂќР±С“В Р±С“вЂ”Р±С“С’Р±С“Сљ Р±С“вЂњР±С“С’Р±С“в„ўР±С“С’Р±С“вЂўР±С“РЃР±С“?Р±С“В Р±С“вЂќР±С“вЂ?Р±С“С’ Р±С“РЃР±С“вЂќР±С“Р€Р±С“В«Р±С“С™Р±С“вЂќР±С“вЂ?Р±С“вЂќР±С“С™Р±С“?Р±С“С’.';
$PHPMAILER_LANG['data_not_accepted']    = 'SMTP Р±С“РЃР±С“вЂќР±С“Р„Р±С“вЂњР±С“СњР±С“вЂєР±С“С’: Р±С“вЂєР±С“СњР±С“СљР±С“С’Р±С“Р„Р±С“вЂќР±С“вЂєР±С“вЂќР±С“вЂ?Р±С“? Р±С“С’Р±С“В  Р±С“?Р±С“ТђР±С“СљР±С“С’ Р±С“вЂєР±С“?Р±С“В¦Р±С“вЂќР±С“вЂ?Р±С“Р€Р±С“С™Р±С“?.';
$PHPMAILER_LANG['encoding']             = 'Р±С“в„ўР±С“СњР±С“вЂњР±С“?Р±С“В Р±С“вЂќР±С“вЂ?Р±С“?Р±С“РЋ Р±С“Р€Р±С“Р„Р±С“СљР±С“СњР±С“вЂ?Р±С“? Р±С“СћР±С“?Р±С“С›Р±С“?: ';
$PHPMAILER_LANG['execute']              = 'Р±С“РЃР±С“вЂќР±С“Р€Р±С“В«Р±С“С™Р±С“вЂќР±С“вЂ?Р±С“вЂќР±С“С™Р±С“?Р±С“С’ Р±С“РЃР±С“вЂќР±С“вЂєР±С“вЂњР±С“вЂќР±С“вЂ™Р±С“? Р±С“вЂ?Р±С“В Р±С“В«Р±С“С’Р±С“СљР±С“вЂќР±С“вЂ?Р±С“?Р±С“РЋ Р±С“РЃР±С“вЂќР±С“РЋР±С“В Р±С“Р€Р±С“С™Р±С“вЂќР±С“вЂ?Р±С“С’: ';
$PHPMAILER_LANG['file_access']          = 'Р±С“РЃР±С“вЂќР±С“Р€Р±С“В«Р±С“С™Р±С“вЂќР±С“вЂ?Р±С“вЂќР±С“С™Р±С“?Р±С“С’ Р±С“В¬Р±С“вЂўР±С“вЂњР±С“СњР±С“вЂєР±С“С’ Р±С“В¤Р±С“С’Р±С“?Р±С“С™Р±С“вЂ”Р±С“С’Р±С“Сљ: ';
$PHPMAILER_LANG['file_open']            = 'Р±С“В¤Р±С“С’Р±С“?Р±С“С™Р±С“Р€Р±С“В Р±С“? Р±С“РЋР±С“?Р±С“РЋР±С“СћР±С“вЂќР±С“вЂєР±С“?Р±С“РЋ Р±С“РЃР±С“вЂќР±С“Р„Р±С“вЂњР±С“СњР±С“вЂєР±С“С’: Р±С“С’Р±С“В  Р±С“?Р±С“В®Р±С“РЋР±С“СљР±С“вЂќР±С“вЂ?Р±С“С’ Р±С“В¤Р±С“С’Р±С“?Р±С“С™Р±С“?: ';
$PHPMAILER_LANG['from_failed']          = 'Р±С“вЂ™Р±С“С’Р±С“вЂєР±С“вЂ™Р±С“вЂ“Р±С“С’Р±С“вЂўР±С“СљР±С“?Р±С“РЋ Р±С“С’Р±С“В Р±С“С’Р±С“РЋР±С“В¬Р±С“СњР±С“В Р±С“? Р±С“вЂєР±С“?Р±С“РЋР±С“С’Р±С“вЂєР±С“С’Р±С“В Р±С“вЂ”Р±С“?: ';
$PHPMAILER_LANG['instantiate']          = 'mail Р±С“В¤Р±С“Р€Р±С“СљР±С“ТђР±С“Р„Р±С“?Р±С“?Р±С“РЋ Р±С“вЂ™Р±С“С’Р±С“РЃР±С“вЂўР±С“вЂќР±С“вЂ?Р±С“С’ Р±С“вЂўР±С“вЂќР±С“В  Р±С“В®Р±С“вЂќР±С“В Р±С“В®Р±С“вЂњР±С“вЂќР±С“вЂ?Р±С“С’.';
$PHPMAILER_LANG['provide_address']      = 'Р±С“вЂ™Р±С“вЂ”Р±С“В®Р±С“СњР±С“вЂўР±С“вЂ” Р±С“вЂєР±С“?Р±С“Р€Р±С“вЂ”Р±С“?Р±С“вЂ”Р±С“СњР±С“вЂ” Р±С“вЂќР±С“В Р±С“вЂ”Р±С“? Р±С“С’Р±С“вЂњР±С“В Р±С“вЂќР±С“РЋР±С“С’Р±С“СћР±С“?Р±С“РЋ e-mail Р±С“вЂєР±С“?Р±С“РЋР±С“С’Р±С“вЂєР±С“С’Р±С“В Р±С“вЂ”Р±С“? Р±С“вЂєР±С“С’Р±С“?Р±С“СљР±С“Р„.';
$PHPMAILER_LANG['mailer_not_supported'] = ' - Р±С“РЋР±С“С’Р±С“В¤Р±С“СњР±С“РЋР±С“СћР±С“Сњ Р±С“РЋР±С“вЂќР±С“В Р±С“вЂўР±С“вЂќР±С“В Р±С“?Р±С“РЋ Р±С“вЂєР±С“В®Р±С“С’Р±С“В Р±С“вЂњР±С“С’Р±С“В­Р±С“вЂќР±С“В Р±С“С’ Р±С“С’Р±С“В  Р±С“С’Р±С“В Р±С“?Р±С“РЋ.';
$PHPMAILER_LANG['recipients_failed']    = 'SMTP Р±С“РЃР±С“вЂќР±С“Р„Р±С“вЂњР±С“СњР±С“вЂєР±С“С’: Р±С“РЃР±С“вЂќР±С“вЂєР±С“вЂњР±С“вЂќР±С“вЂ™ Р±С“вЂєР±С“?Р±С“РЋР±С“С’Р±С“вЂєР±С“С’Р±С“В Р±С“вЂ”Р±С“вЂќР±С“вЂ?Р±С“вЂ“Р±С“вЂќ Р±С“вЂ™Р±С“С’Р±С“вЂ™Р±С“вЂ“Р±С“С’Р±С“вЂўР±С“СљР±С“С’ Р±С“вЂўР±С“вЂќР±С“В  Р±С“вЂєР±С“СњР±С“В®Р±С“вЂќР±С“В Р±С“В®Р±С“вЂњР±С“С’: ';
$PHPMAILER_LANG['empty_message']        = 'Р±С“РЃР±С“вЂќР±С“СћР±С“В§Р±С“СњР±С“вЂ?Р±С“?Р±С“СљР±С“вЂќР±С“вЂ?Р±С“С’ Р±С“Р„Р±С“С’Р±С“В Р±С“?Р±С“вЂќР±С“С™Р±С“?Р±С“С’';
$PHPMAILER_LANG['invalid_address']      = 'Р±С“С’Р±С“В  Р±С“вЂ™Р±С“С’Р±С“?Р±С“вЂ™Р±С“вЂ“Р±С“С’Р±С“вЂўР±С“СљР±С“С’, e-mail Р±С“вЂєР±С“?Р±С“РЋР±С“С’Р±С“вЂєР±С“С’Р±С“В Р±С“вЂ”Р±С“?Р±С“РЋ Р±С“С’Р±С“В Р±С“С’Р±С“РЋР±С“В¬Р±С“СњР±С“В Р±С“? Р±С“В¤Р±С“СњР±С“В Р±С“вЂєР±С“С’Р±С“СћР±С“?: ';
$PHPMAILER_LANG['signing']              = 'Р±С“В®Р±С“вЂќР±С“С™Р±С“вЂєР±С“СњР±С“В¬Р±С“вЂќР±С“В Р±С“?Р±С“РЋ Р±С“РЃР±С“вЂќР±С“Р„Р±С“вЂњР±С“СњР±С“вЂєР±С“С’: ';
$PHPMAILER_LANG['smtp_connect_failed']  = 'Р±С“РЃР±С“вЂќР±С“Р„Р±С“вЂњР±С“СњР±С“вЂєР±С“С’ SMTP Р±С“РЋР±С“вЂќР±С“В Р±С“вЂўР±С“вЂќР±С“В Р±С“вЂ”Р±С“С’Р±С“Сљ Р±С“вЂњР±С“С’Р±С“в„ўР±С“С’Р±С“вЂўР±С“РЃР±С“?Р±С“В Р±С“вЂќР±С“вЂ?Р±С“?Р±С“РЋР±С“С’Р±С“РЋ';
$PHPMAILER_LANG['smtp_error']           = 'SMTP Р±С“РЋР±С“вЂќР±С“В Р±С“вЂўР±С“вЂќР±С“В Р±С“?Р±С“РЋ Р±С“РЃР±С“вЂќР±С“Р„Р±С“вЂњР±С“СњР±С“вЂєР±С“С’: ';
$PHPMAILER_LANG['variable_set']         = 'Р±С“РЃР±С“вЂќР±С“Р€Р±С“В«Р±С“С™Р±С“вЂќР±С“вЂ?Р±С“вЂќР±С“С™Р±С“?Р±С“С’ Р±С“РЃР±С“вЂќР±С“вЂєР±С“вЂњР±С“вЂќР±С“вЂ™Р±С“? Р±С“Р„Р±С“вЂўР±С“С™Р±С“С’Р±С“вЂњР±С“?Р±С“РЋ Р±С“РЃР±С“вЂќР±С“ТђР±С“вЂєР±С“СљР±С“С’ Р±С“С’Р±С“Сљ Р±С“РЃР±С“вЂќР±С“Р„Р±С“вЂўР±С“С™Р±С“С’: ';
//$PHPMAILER_LANG['extension_missing']    = 'Extension missing: ';
