<?php
/**
 * Persian/Farsi PHPMailer language file: refer to English translation for definitive list
 * @package PHPMailer
 * @author Ali Jazayeri <jaza.ali@gmail.com>
 * @author Mohammad Hossein Mojtahedi <mhm5000@gmail.com>
 */

$PHPMAILER_LANG['authenticate']         = 'РЁВ®РЁВ·РЁВ§Р«РЉ SMTP: РЁВ§РЁВ­РЁВ±РЁВ§РЁР† Р©вЂЎР©в‚¬Р«РЉРЁР„ РЁРЃРЁВ§ РЁТ‘РЄВ©РЁС–РЁР„ Р©вЂ¦Р©в‚¬РЁВ§РЁВ¬Р©вЂЎ РЁТ‘РЁР‡.';
$PHPMAILER_LANG['connect_host']         = 'РЁВ®РЁВ·РЁВ§Р«РЉ SMTP: РЁВ§РЁР„РЁВµРЁВ§Р©вЂћ РЁРЃР©вЂЎ РЁС–РЁВ±Р©в‚¬РЁВ± SMTP РЁРЃРЁВ±Р©вЂљРЁВ±РЁВ§РЁВ± Р©вЂ РЁТ‘РЁР‡.';
$PHPMAILER_LANG['data_not_accepted']    = 'РЁВ®РЁВ·РЁВ§Р«РЉ SMTP: РЁР‡РЁВ§РЁР‡Р©вЂЎРІР‚РЉР©вЂЎРЁВ§ Р©вЂ РЁВ§РІР‚РЉРЁР‡РЁВ±РЁС–РЁР„ Р©вЂЎРЁС–РЁР„Р©вЂ РЁР‡.';
$PHPMAILER_LANG['empty_message']        = 'РЁРЃРЁВ®РЁТ‘ Р©вЂ¦РЁР„Р©вЂ  Р©С•Р«РЉРЁВ§Р©вЂ¦ РЁВ®РЁВ§Р©вЂћР«РЉ РЁВ§РЁС–РЁР„.';
$PHPMAILER_LANG['encoding']             = 'РЄВ©РЁР‡РІР‚РЉРЄР‡РЁВ°РЁВ§РЁВ±Р«РЉ Р©вЂ РЁВ§РІР‚РЉРЁТ‘Р©вЂ РЁВ§РЁВ®РЁР„Р©вЂЎ: ';
$PHPMAILER_LANG['execute']              = 'РЁВ§Р©вЂ¦РЄВ©РЁВ§Р©вЂ  РЁВ§РЁВ¬РЁВ±РЁВ§ Р©в‚¬РЁВ¬Р©в‚¬РЁР‡ Р©вЂ РЁР‡РЁВ§РЁВ±РЁР‡: ';
$PHPMAILER_LANG['file_access']          = 'РЁВ§Р©вЂ¦РЄВ©РЁВ§Р©вЂ  РЁР‡РЁС–РЁР„РЁВ±РЁС–Р«РЉ РЁРЃР©вЂЎ Р©РѓРЁВ§Р«РЉР©вЂћ Р©в‚¬РЁВ¬Р©в‚¬РЁР‡ Р©вЂ РЁР‡РЁВ§РЁВ±РЁР‡: ';
$PHPMAILER_LANG['file_open']            = 'РЁВ®РЁВ·РЁВ§Р«РЉ File: РЁВ§Р©вЂ¦РЄВ©РЁВ§Р©вЂ  РЁРЃРЁВ§РЁР†РЄВ©РЁВ±РЁР‡Р©вЂ  Р©РѓРЁВ§Р«РЉР©вЂћ Р©в‚¬РЁВ¬Р©в‚¬РЁР‡ Р©вЂ РЁР‡РЁВ§РЁВ±РЁР‡: ';
$PHPMAILER_LANG['from_failed']          = 'РЁСћРЁР‡РЁВ±РЁС– Р©РѓРЁВ±РЁС–РЁР„Р©вЂ РЁР‡Р©вЂЎ РЁВ§РЁТ‘РЁР„РЁРЃРЁВ§Р©вЂЎ РЁВ§РЁС–РЁР„: ';
$PHPMAILER_LANG['instantiate']          = 'РЁВ§Р©вЂ¦РЄВ©РЁВ§Р©вЂ  Р©вЂ¦РЁв„–РЁВ±Р©РѓР«РЉ РЁР„РЁВ§РЁРЃРЁв„– РЁВ§Р«РЉР©вЂ¦Р«РЉР©вЂћ Р©в‚¬РЁВ¬Р©в‚¬РЁР‡ Р©вЂ РЁР‡РЁВ§РЁВ±РЁР‡.';
$PHPMAILER_LANG['invalid_address']      = 'РЁСћРЁР‡РЁВ±РЁС– РЁВ§Р«РЉР©вЂ¦Р«РЉР©вЂћ Р©вЂ¦РЁв„–РЁР„РЁРЃРЁВ± Р©вЂ Р«РЉРЁС–РЁР„: ';
$PHPMAILER_LANG['mailer_not_supported'] = ' mailer Р©С•РЁТ‘РЁР„Р«РЉРЁРЃРЁВ§Р©вЂ Р«РЉ Р©вЂ Р©вЂ¦Р«РЉРІР‚РЉРЁТ‘Р©в‚¬РЁР‡.';
$PHPMAILER_LANG['provide_address']      = 'РЁРЃРЁВ§Р«РЉРЁР‡ РЁВ­РЁР‡РЁВ§Р©вЂљР©вЂћ Р«РЉРЄВ© РЁСћРЁР‡РЁВ±РЁС– РЄР‡Р«РЉРЁВ±Р©вЂ РЁР‡Р©вЂЎ Р©в‚¬РЁВ§РЁВ±РЁР‡ РЄВ©Р©вЂ Р«РЉРЁР‡.';
$PHPMAILER_LANG['recipients_failed']    = 'РЁВ®РЁВ·РЁВ§Р«РЉ SMTP: РЁВ§РЁВ±РЁС–РЁВ§Р©вЂћ РЁРЃР©вЂЎ РЁСћРЁР‡РЁВ±РЁС– РЄР‡Р«РЉРЁВ±Р©вЂ РЁР‡Р©вЂЎ РЁРЃРЁВ§ РЁВ®РЁВ·РЁВ§ Р©вЂ¦Р©в‚¬РЁВ§РЁВ¬Р©вЂЎ РЁТ‘РЁР‡: ';
$PHPMAILER_LANG['signing']              = 'РЁВ®РЁВ·РЁВ§ РЁР‡РЁВ± РЁВ§Р©вЂ¦РЁВ¶РЁВ§: ';
$PHPMAILER_LANG['smtp_connect_failed']  = 'РЁВ®РЁВ·РЁВ§ РЁР‡РЁВ± РЁВ§РЁР„РЁВµРЁВ§Р©вЂћ РЁРЃР©вЂЎ SMTP.';
$PHPMAILER_LANG['smtp_error']           = 'РЁВ®РЁВ·РЁВ§ РЁР‡РЁВ± SMTP Server: ';
$PHPMAILER_LANG['variable_set']         = 'РЁВ§Р©вЂ¦РЄВ©РЁВ§Р©вЂ  РЁВ§РЁВ±РЁС–РЁВ§Р©вЂћ Р«РЉРЁВ§ РЁВ§РЁВ±РЁС–РЁВ§Р©вЂћ Р©вЂ¦РЁВ¬РЁР‡РЁР‡ Р©вЂ¦РЁР„РЁС”Р«РЉРЁВ±РІР‚РЉР©вЂЎРЁВ§ Р©в‚¬РЁВ¬Р©в‚¬РЁР‡ Р©вЂ РЁР‡РЁВ§РЁВ±РЁР‡: ';
//$PHPMAILER_LANG['extension_missing']    = 'Extension missing: ';
