<?php
/**
 * Bulgarian PHPMailer language file: refer to English translation for definitive list
 * @package PHPMailer
 * @author Mikhail Kyosev <mialygk@gmail.com>
 */

$PHPMAILER_LANG['authenticate']         = 'SMTP Р С–РЎР‚Р ВµРЎв‚¬Р С”Р В°: Р СњР Вµ Р С?Р С•Р В¶Р Вµ Р Т‘Р В° РЎРѓР Вµ РЎС“Р Т‘Р С•РЎРѓРЎвЂљР С•Р Р†Р ВµРЎР‚Р С‘ Р С—РЎР‚Р ВµР Т‘ РЎРѓРЎР‰РЎР‚Р Р†РЎР‰РЎР‚Р В°.';
$PHPMAILER_LANG['connect_host']         = 'SMTP Р С–РЎР‚Р ВµРЎв‚¬Р С”Р В°: Р СњР Вµ Р С?Р С•Р В¶Р Вµ Р Т‘Р В° РЎРѓР Вµ РЎРѓР Р†РЎР‰РЎР‚Р В¶Р Вµ РЎРѓ SMTP РЎвЂ¦Р С•РЎРѓРЎвЂљР В°.';
$PHPMAILER_LANG['data_not_accepted']    = 'SMTP Р С–РЎР‚Р ВµРЎв‚¬Р С”Р В°: Р Т‘Р В°Р Р…Р Р…Р С‘РЎвЂљР Вµ Р Р…Р Вµ РЎРѓР В° Р С—РЎР‚Р С‘Р ВµРЎвЂљР С‘.';
$PHPMAILER_LANG['empty_message']        = 'Р РЋРЎР‰Р Т‘РЎР‰РЎР‚Р В¶Р В°Р Р…Р С‘Р ВµРЎвЂљР С• Р Р…Р В° РЎРѓРЎР‰Р С•Р В±РЎвЂ°Р ВµР Р…Р С‘Р ВµРЎвЂљР С• Р Вµ Р С—РЎР‚Р В°Р В·Р Р…Р С•';
$PHPMAILER_LANG['encoding']             = 'Р СњР ВµР С‘Р В·Р Р†Р ВµРЎРѓРЎвЂљР Р…Р С• Р С”Р С•Р Т‘Р С‘РЎР‚Р В°Р Р…Р Вµ: ';
$PHPMAILER_LANG['execute']              = 'Р СњР Вµ Р С?Р С•Р В¶Р Вµ Р Т‘Р В° РЎРѓР Вµ Р С‘Р В·Р С—РЎР‰Р В»Р Р…Р С‘: ';
$PHPMAILER_LANG['file_access']          = 'Р СњРЎРЏР С?Р В° Р Т‘Р С•РЎРѓРЎвЂљРЎР‰Р С— Р Т‘Р С• РЎвЂћР В°Р в„–Р В»: ';
$PHPMAILER_LANG['file_open']            = 'Р В¤Р В°Р в„–Р В»Р С•Р Р†Р В° Р С–РЎР‚Р ВµРЎв‚¬Р С”Р В°: Р СњР Вµ Р С?Р С•Р В¶Р Вµ Р Т‘Р В° РЎРѓР Вµ Р С•РЎвЂљР Р†Р С•РЎР‚Р С‘ РЎвЂћР В°Р в„–Р В»: ';
$PHPMAILER_LANG['from_failed']          = 'Р РЋР В»Р ВµР Т‘Р Р…Р С‘РЎвЂљР Вµ Р В°Р Т‘РЎР‚Р ВµРЎРѓР С‘ Р В·Р В° Р С—Р С•Р Т‘Р В°РЎвЂљР ВµР В» РЎРѓР В° Р Р…Р ВµР Р†Р В°Р В»Р С‘Р Т‘Р Р…Р С‘: ';
$PHPMAILER_LANG['instantiate']          = 'Р СњР Вµ Р С?Р С•Р В¶Р Вµ Р Т‘Р В° РЎРѓР Вµ Р С‘Р Р…РЎРѓРЎвЂљР В°Р Р…РЎвЂ Р С‘РЎР‚Р В° РЎвЂћРЎС“Р Р…Р С”РЎвЂ Р С‘РЎРЏРЎвЂљР В° mail.';
$PHPMAILER_LANG['invalid_address']      = 'Р СњР ВµР Р†Р В°Р В»Р С‘Р Т‘Р ВµР Р… Р В°Р Т‘РЎР‚Р ВµРЎРѓ: ';
$PHPMAILER_LANG['mailer_not_supported'] = ' - Р С—Р С•РЎвЂ°Р ВµР Р…РЎРѓР С”Р С‘ РЎРѓРЎР‰РЎР‚Р Р†РЎР‰РЎР‚ Р Р…Р Вµ РЎРѓР Вµ Р С—Р С•Р Т‘Р Т‘РЎР‰РЎР‚Р В¶Р В°.';
$PHPMAILER_LANG['provide_address']      = 'Р СћРЎР‚РЎРЏР В±Р Р†Р В° Р Т‘Р В° Р С—РЎР‚Р ВµР Т‘Р С•РЎРѓРЎвЂљР В°Р Р†Р С‘РЎвЂљР Вµ Р С—Р С•Р Р…Р Вµ Р ВµР Т‘Р С‘Р Р… email Р В°Р Т‘РЎР‚Р ВµРЎРѓ Р В·Р В° Р С—Р С•Р В»РЎС“РЎвЂЎР В°РЎвЂљР ВµР В».';
$PHPMAILER_LANG['recipients_failed']    = 'SMTP Р С–РЎР‚Р ВµРЎв‚¬Р С”Р В°: Р РЋР В»Р ВµР Т‘Р Р…Р С‘РЎвЂљР Вµ Р В°Р Т‘РЎР‚Р ВµРЎРѓР С‘ Р В·Р В° Р СџР С•Р В»РЎС“РЎвЂЎР В°РЎвЂљР ВµР В» РЎРѓР В° Р Р…Р ВµР Р†Р В°Р В»Р С‘Р Т‘Р Р…Р С‘: ';
$PHPMAILER_LANG['signing']              = 'Р вЂњРЎР‚Р ВµРЎв‚¬Р С”Р В° Р С—РЎР‚Р С‘ Р С—Р С•Р Т‘Р С—Р С‘РЎРѓР Р†Р В°Р Р…Р Вµ: ';
$PHPMAILER_LANG['smtp_connect_failed']  = 'SMTP Р С—РЎР‚Р С•Р Р†Р В°Р В»Р ВµР Р… connect().';
$PHPMAILER_LANG['smtp_error']           = 'SMTP РЎРѓРЎР‰РЎР‚Р Р†РЎР‰РЎР‚Р Р…Р В° Р С–РЎР‚Р ВµРЎв‚¬Р С”Р В°: ';
$PHPMAILER_LANG['variable_set']         = 'Р СњР Вµ Р С?Р С•Р В¶Р Вµ Р Т‘Р В° РЎРѓР Вµ РЎС“РЎРѓРЎвЂљР В°Р Р…Р С•Р Р†Р С‘ Р С‘Р В»Р С‘ Р Р†РЎР‰Р В·РЎРѓРЎвЂљР В°Р Р…Р С•Р Р†Р С‘ Р С—РЎР‚Р С•Р С?Р ВµР Р…Р В»Р С‘Р Р†Р В°: ';
$PHPMAILER_LANG['extension_missing']    = 'Р вЂєР С‘Р С—РЎРѓР Р†Р В° РЎР‚Р В°Р В·РЎв‚¬Р С‘РЎР‚Р ВµР Р…Р С‘Р Вµ: ';
