<?php
/**
 * Arabic PHPMailer language file: refer to English translation for definitive list
 * @package PHPMailer
 * @author bahjat al mostafa <bahjat983@hotmail.com>
 */

$PHPMAILER_LANG['authenticate']         = 'РЁВ®РЁВ·РЁР€ SMTP : Р©вЂћРЁВ§ Р©Р‰Р©вЂ¦Р©С“Р©вЂ  РЁР„РЁР€Р©С“Р©Р‰РЁР‡ РЁВ§Р©вЂћР©вЂЎР©в‚¬Р©Р‰РЁВ©.';
$PHPMAILER_LANG['connect_host']         = 'РЁВ®РЁВ·РЁР€ SMTP: Р©вЂћРЁВ§ Р©Р‰Р©вЂ¦Р©С“Р©вЂ  РЁВ§Р©вЂћРЁВ§РЁР„РЁВµРЁВ§Р©вЂћ РЁРЃРЁВ§Р©вЂћРЁВ®РЁВ§РЁР‡Р©вЂ¦ SMTP.';
$PHPMAILER_LANG['data_not_accepted']    = 'РЁВ®РЁВ·РЁР€ SMTP: Р©вЂћР©вЂ¦ Р©Р‰РЁР„Р©вЂ¦ Р©вЂљРЁРЃР©в‚¬Р©вЂћ РЁВ§Р©вЂћР©вЂ¦РЁв„–Р©вЂћР©в‚¬Р©вЂ¦РЁВ§РЁР„ .';
$PHPMAILER_LANG['empty_message']        = 'Р©вЂ РЁВµ РЁВ§Р©вЂћРЁВ±РЁС–РЁВ§Р©вЂћРЁВ© Р©РѓРЁВ§РЁВ±РЁС”';
$PHPMAILER_LANG['encoding']             = 'РЁР„РЁВ±Р©вЂ¦Р©Р‰РЁР† РЁС”Р©Р‰РЁВ± Р©вЂ¦РЁв„–РЁВ±Р©в‚¬Р©Рѓ: ';
$PHPMAILER_LANG['execute']              = 'Р©вЂћРЁВ§ Р©Р‰Р©вЂ¦Р©С“Р©вЂ  РЁР„Р©вЂ Р©РѓР©Р‰РЁВ° : ';
$PHPMAILER_LANG['file_access']          = 'Р©вЂћРЁВ§ Р©Р‰Р©вЂ¦Р©С“Р©вЂ  РЁВ§Р©вЂћР©в‚¬РЁВµР©в‚¬Р©вЂћ Р©вЂћР©вЂћР©вЂ¦Р©вЂћР©Рѓ: ';
$PHPMAILER_LANG['file_open']            = 'РЁВ®РЁВ·РЁР€ Р©РѓР©Р‰ РЁВ§Р©вЂћР©вЂ¦Р©вЂћР©Рѓ: Р©вЂћРЁВ§ Р©Р‰Р©вЂ¦Р©С“Р©вЂ  Р©РѓРЁР„РЁВ­Р©вЂЎ: ';
$PHPMAILER_LANG['from_failed']          = 'РЁВ®РЁВ·РЁР€ РЁв„–Р©вЂћР©вЂ° Р©вЂ¦РЁС–РЁР„Р©в‚¬Р©вЂ° РЁв„–Р©вЂ Р©в‚¬РЁВ§Р©вЂ  РЁВ§Р©вЂћР©вЂ¦РЁВ±РЁС–Р©вЂћ : ';
$PHPMAILER_LANG['instantiate']          = 'Р©вЂћРЁВ§ Р©Р‰Р©вЂ¦Р©С“Р©вЂ  РЁР„Р©в‚¬Р©РѓР©Р‰РЁВ± РЁВ®РЁР‡Р©вЂ¦РЁВ© РЁВ§Р©вЂћРЁРЃРЁВ±Р©Р‰РЁР‡.';
$PHPMAILER_LANG['invalid_address']      = 'РЁВ§Р©вЂћРЁТђРЁВ±РЁС–РЁВ§Р©вЂћ РЁС”Р©Р‰РЁВ± Р©вЂ¦Р©вЂ¦Р©С“Р©вЂ  Р©вЂћРЁР€Р©вЂ  РЁв„–Р©вЂ Р©в‚¬РЁВ§Р©вЂ  РЁВ§Р©вЂћРЁРЃРЁВ±Р©Р‰РЁР‡ РЁВ§Р©вЂћРЁТђР©вЂћР©С“РЁР„РЁВ±Р©в‚¬Р©вЂ Р©Р‰ РЁС”Р©Р‰РЁВ± РЁВµРЁВ§Р©вЂћРЁВ­: ';
$PHPMAILER_LANG['mailer_not_supported'] = ' РЁРЃРЁВ±Р©вЂ РЁВ§Р©вЂ¦РЁВ¬ РЁВ§Р©вЂћРЁТђРЁВ±РЁС–РЁВ§Р©вЂћ РЁС”Р©Р‰РЁВ± Р©вЂ¦РЁР‡РЁв„–Р©в‚¬Р©вЂ¦.';
$PHPMAILER_LANG['provide_address']      = 'Р©Р‰РЁВ¬РЁРЃ РЁР„Р©в‚¬Р©РѓР©Р‰РЁВ± РЁв„–Р©вЂ Р©в‚¬РЁВ§Р©вЂ  РЁВ§Р©вЂћРЁРЃРЁВ±Р©Р‰РЁР‡ РЁВ§Р©вЂћРЁТђР©вЂћР©С“РЁР„РЁВ±Р©в‚¬Р©вЂ Р©Р‰ Р©вЂћР©вЂ¦РЁС–РЁР„Р©вЂћР©вЂ¦ Р©в‚¬РЁВ§РЁВ­РЁР‡ РЁв„–Р©вЂћР©вЂ° РЁВ§Р©вЂћРЁР€Р©вЂљР©вЂћ.';
$PHPMAILER_LANG['recipients_failed']    = 'РЁВ®РЁВ·РЁР€ SMTP: РЁВ§Р©вЂћРЁР€РЁВ®РЁВ·РЁВ§РЁРЋ РЁВ§Р©вЂћРЁР„РЁВ§Р©вЂћР©Р‰РЁВ© ' .
                                          'Р©РѓРЁТ‘Р©вЂћ Р©РѓР©Р‰ РЁВ§Р©вЂћРЁВ§РЁВ±РЁС–РЁВ§Р©вЂћ Р©вЂћР©С“Р©вЂћ Р©вЂ¦Р©вЂ  : ';
$PHPMAILER_LANG['signing']              = 'РЁВ®РЁВ·РЁР€ Р©РѓР©Р‰ РЁВ§Р©вЂћРЁР„Р©в‚¬Р©вЂљР©Р‰РЁв„–: ';
$PHPMAILER_LANG['smtp_connect_failed']  = 'SMTP Connect() РЁС”Р©Р‰РЁВ± Р©вЂ¦Р©вЂ¦Р©С“Р©вЂ .';
$PHPMAILER_LANG['smtp_error']           = 'РЁВ®РЁВ·РЁР€ РЁв„–Р©вЂћР©вЂ° Р©вЂ¦РЁС–РЁР„Р©в‚¬Р©вЂ° РЁВ§Р©вЂћРЁВ®РЁВ§РЁР‡Р©вЂ¦ SMTP: ';
$PHPMAILER_LANG['variable_set']         = 'Р©вЂћРЁВ§ Р©Р‰Р©вЂ¦Р©С“Р©вЂ  РЁР„РЁв„–Р©Р‰Р©Р‰Р©вЂ  РЁР€Р©в‚¬ РЁТђРЁв„–РЁВ§РЁР‡РЁВ© РЁР„РЁв„–Р©Р‰Р©Р‰Р©вЂ  Р©вЂ¦РЁР„РЁС”Р©Р‰РЁВ±: ';
//$PHPMAILER_LANG['extension_missing']    = 'Extension missing: ';
